In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\Dell'

In [3]:
import pandas as pd

In [4]:
data4 = pd.read_excel(r'MyDat1.xlsx')

In [5]:
data4

    Name  Age  Salary
0  Pinky   30   20000
1   John   22   15000
2   Neha   25   30000
3    raj   26   35000